src/cf/AccumulationRegisters/ЗапасТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасТоплива</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/Полет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Полет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасТоплива</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/КартаЗвездногоНебаПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Местоположение - Структура:
//  * ТекущаяПланета - СправочникСсылка.Планеты - Планета, на которой находится корабль.
//  * ТекущийЗапасТоплива - Число - Сколько топлива осталось в баках.
//
Процедура ПриОпределенииМестоположения(Местоположение) Экспорт
	
	// тест
	
	Местоположение.ТекущаяПланета = Константы.ТекущаяПланета.Получить();
	Местоположение.ТекущийЗапасТоплива = РегистрыНакопления.ЗапасТоплива.Остатки()[0].Количество;
	
КонецПроцедуры

// Местоположение - Структура:
//  * ТекущаяПланета - СправочникСсылка.Планеты - Планета, на которой находится корабль.
//  * ПанетаНазначения - СправочникСсылка.Планеты - Планета, на которую корабль будет перемещен.
//  * ПотраченоТоплива - Число - Затраченное топливо на перелет.
//
Процедура ПриУстановкеМестоположения(Местоположение) Экспорт
	
	Полет = Документы.Полет.СоздатьДокумент();
	Полет.Дата = ТекущаяДатаСеанса();
	Полет.ИсходныйПункт = Местоположение.ТекущаяПланета;
	Полет.КонечныйПункт = Местоположение.ПанетаНазначения;
	Полет.КоличествоТоплива = Местоположение.ПотраченоТоплива;
	Полет.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти
